ARMmbed/mbed-os/targets/TARGET_Atmel/TARGET_SAM_CortexM0P/utils/cmsis/TARGET_SAMR21/include/component/comp_evsys.h
#define EVSYS_USER_OFFSET           0x08         /**< \brief (EVSYS_USER offset) User Multiplexer */
#define EVSYS_USER_RESETVALUE       0x0000ul     /**< \brief (EVSYS_USER reset_value) User Multiplexer */

#define EVSYS_USER_USER_Pos         0            /**< \brief (EVSYS_USER) User Multiplexer Selection */
#define EVSYS_USER_USER_Msk         (0x1Ful << EVSYS_USER_USER_Pos)
#define EVSYS_USER_USER(value)      (EVSYS_USER_USER_Msk & ((value) << EVSYS_USER_USER_Pos))
#define EVSYS_USER_CHANNEL_Pos      8            /**< \brief (EVSYS_USER) Channel Event Selection */
#define EVSYS_USER_CHANNEL_Msk      (0x1Ful << EVSYS_USER_CHANNEL_Pos)
#define EVSYS_USER_CHANNEL(value)   (EVSYS_USER_CHANNEL_Msk & ((value) << EVSYS_USER_CHANNEL_Pos))
#define   EVSYS_USER_CHANNEL_0_Val        0x0ul  /**< \brief (EVSYS_USER) No Channel Output Selected */
#define EVSYS_USER_CHANNEL_0        (EVSYS_USER_CHANNEL_0_Val      << EVSYS_USER_CHANNEL_Pos)
#define EVSYS_USER_MASK             0x1F1Ful     /**< \brief (EVSYS_USER) MASK Register */

/* -------- EVSYS_CHSTATUS : (EVSYS Offset: 0x0C) (R/  32) Channel Status -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
    struct {
        uint32_t USRRDY0: 1;       /*!< bit:      0  Channel 0 User Ready               */
        uint32_t USRRDY1: 1;       /*!< bit:      1  Channel 1 User Ready               */
        uint32_t USRRDY2: 1;       /*!< bit:      2  Channel 2 User Ready               */
        uint32_t USRRDY3: 1;       /*!< bit:      3  Channel 3 User Ready               */
        uint32_t USRRDY4: 1;       /*!< bit:      4  Channel 4 User Ready               */
        uint32_t USRRDY5: 1;       /*!< bit:      5  Channel 5 User Ready               */
        uint32_t USRRDY6: 1;       /*!< bit:      6  Channel 6 User Ready               */
        uint32_t USRRDY7: 1;       /*!< bit:      7  Channel 7 User Ready               */
        uint32_t CHBUSY0: 1;       /*!< bit:      8  Channel 0 Busy                     */
        uint32_t CHBUSY1: 1;       /*!< bit:      9  Channel 1 Busy                     */
        uint32_t CHBUSY2: 1;       /*!< bit:     10  Channel 2 Busy                     */
        uint32_t CHBUSY3: 1;       /*!< bit:     11  Channel 3 Busy                     */
        uint32_t CHBUSY4: 1;       /*!< bit:     12  Channel 4 Busy                     */
        uint32_t CHBUSY5: 1;       /*!< bit:     13  Channel 5 Busy                     */
        uint32_t CHBUSY6: 1;       /*!< bit:     14  Channel 6 Busy                     */
        uint32_t CHBUSY7: 1;       /*!< bit:     15  Channel 7 Busy                     */
        uint32_t USRRDY8: 1;       /*!< bit:     16  Channel 8 User Ready               */
        uint32_t USRRDY9: 1;       /*!< bit:     17  Channel 9 User Ready               */
        uint32_t USRRDY10: 1;      /*!< bit:     18  Channel 10 User Ready              */
        uint32_t USRRDY11: 1;      /*!< bit:     19  Channel 11 User Ready              */
        uint32_t : 4;              /*!< bit: 20..23  Reserved                           */
        uint32_t CHBUSY8: 1;       /*!< bit:     24  Channel 8 Busy                     */
        uint32_t CHBUSY9: 1;       /*!< bit:     25  Channel 9 Busy                     */
        uint32_t CHBUSY10: 1;      /*!< bit:     26  Channel 10 Busy                    */
        uint32_t CHBUSY11: 1;      /*!< bit:     27  Channel 11 Busy                    */
        uint32_t : 4;              /*!< bit: 28..31  Reserved                           */
    } bit;                       /*!< Structure used for bit  access                  */
    struct {
        uint32_t USRRDY: 8;        /*!< bit:  0.. 7  Channel x User Ready               */
        uint32_t CHBUSY: 8;        /*!< bit:  8..15  Channel x Busy                     */
        uint32_t USRRDYp8: 4;      /*!< bit: 16..19  Channel x+8 User Ready             */
        uint32_t : 4;              /*!< bit: 20..23  Reserved                           */
        uint32_t CHBUSYp8: 4;      /*!< bit: 24..27  Channel x+8 Busy                   */
        uint32_t : 4;              /*!< bit: 28..31  Reserved                           */
    } vec;                       /*!< Structure used for vec  access                  */
    uint32_t reg;                /*!< Type      used for register access              */
} EVSYS_CHSTATUS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define EVSYS_CHSTATUS_OFFSET       0x0C         /**< \brief (EVSYS_CHSTATUS offset) Channel Status */
#define EVSYS_CHSTATUS_RESETVALUE   0x000F00FFul /**< \brief (EVSYS_CHSTATUS reset_value) Channel Status */

#define EVSYS_CHSTATUS_USRRDY0_Pos  0            /**< \brief (EVSYS_CHSTATUS) Channel 0 User Ready */
#define EVSYS_CHSTATUS_USRRDY0      (1 << EVSYS_CHSTATUS_USRRDY0_Pos)
#define EVSYS_CHSTATUS_USRRDY1_Pos  1            /**< \brief (EVSYS_CHSTATUS) Channel 1 User Ready */
#define EVSYS_CHSTATUS_USRRDY1      (1 << EVSYS_CHSTATUS_USRRDY1_Pos)
#define EVSYS_CHSTATUS_USRRDY2_Pos  2            /**< \brief (EVSYS_CHSTATUS) Channel 2 User Ready */
#define EVSYS_CHSTATUS_USRRDY2      (1 << EVSYS_CHSTATUS_USRRDY2_Pos)
#define EVSYS_CHSTATUS_USRRDY3_Pos  3            /**< \brief (EVSYS_CHSTATUS) Channel 3 User Ready */
#define EVSYS_CHSTATUS_USRRDY3      (1 << EVSYS_CHSTATUS_USRRDY3_Pos)
#define EVSYS_CHSTATUS_USRRDY4_Pos  4            /**< \brief (EVSYS_CHSTATUS) Channel 4 User Ready */
#define EVSYS_CHSTATUS_USRRDY4      (1 << EVSYS_CHSTATUS_USRRDY4_Pos)
#define EVSYS_CHSTATUS_USRRDY5_Pos  5            /**< \brief (EVSYS_CHSTATUS) Channel 5 User Ready */
#define EVSYS_CHSTATUS_USRRDY5      (1 << EVSYS_CHSTATUS_USRRDY5_Pos)
#define EVSYS_CHSTATUS_USRRDY6_Pos  6            /**< \brief (EVSYS_CHSTATUS) Channel 6 User Ready */
#define EVSYS_CHSTATUS_USRRDY6      (1 << EVSYS_CHSTATUS_USRRDY6_Pos)
#define EVSYS_CHSTATUS_USRRDY7_Pos  7            /**< \brief (EVSYS_CHSTATUS) Channel 7 User Ready */
#define EVSYS_CHSTATUS_USRRDY7      (1 << EVSYS_CHSTATUS_USRRDY7_Pos)
#define EVSYS_CHSTATUS_USRRDY_Pos   0            /**< \brief (EVSYS_CHSTATUS) Channel x User Ready */
#define EVSYS_CHSTATUS_USRRDY_Msk   (0xFFul << EVSYS_CHSTATUS_USRRDY_Pos)
#define EVSYS_CHSTATUS_USRRDY(value) (EVSYS_CHSTATUS_USRRDY_Msk & ((value) << EVSYS_CHSTATUS_USRRDY_Pos))
#define EVSYS_CHSTATUS_CHBUSY0_Pos  8            /**< \brief (EVSYS_CHSTATUS) Channel 0 Busy */
#define EVSYS_CHSTATUS_CHBUSY0      (1 << EVSYS_CHSTATUS_CHBUSY0_Pos)
#define EVSYS_CHSTATUS_CHBUSY1_Pos  9            /**< \brief (EVSYS_CHSTATUS) Channel 1 Busy */
#define EVSYS_CHSTATUS_CHBUSY1      (1 << EVSYS_CHSTATUS_CHBUSY1_Pos)
#define EVSYS_CHSTATUS_CHBUSY2_Pos  10           /**< \brief (EVSYS_CHSTATUS) Channel 2 Busy */
#define EVSYS_CHSTATUS_CHBUSY2      (1 << EVSYS_CHSTATUS_CHBUSY2_Pos)
#define EVSYS_CHSTATUS_CHBUSY3_Pos  11           /**< \brief (EVSYS_CHSTATUS) Channel 3 Busy */
#define EVSYS_CHSTATUS_CHBUSY3      (1 << EVSYS_CHSTATUS_CHBUSY3_Pos)
#define EVSYS_CHSTATUS_CHBUSY4_Pos  12           /**< \brief (EVSYS_CHSTATUS) Channel 4 Busy */
#define EVSYS_CHSTATUS_CHBUSY4      (1 << EVSYS_CHSTATUS_CHBUSY4_Pos)
#define EVSYS_CHSTATUS_CHBUSY5_Pos  13           /**< \brief (EVSYS_CHSTATUS) Channel 5 Busy */
#define EVSYS_CHSTATUS_CHBUSY5      (1 << EVSYS_CHSTATUS_CHBUSY5_Pos)
#define EVSYS_CHSTATUS_CHBUSY6_Pos  14           /**< \brief (EVSYS_CHSTATUS) Channel 6 Busy */
#define EVSYS_CHSTATUS_CHBUSY6      (1 << EVSYS_CHSTATUS_CHBUSY6_Pos)
#define EVSYS_CHSTATUS_CHBUSY7_Pos  15           /**< \brief (EVSYS_CHSTATUS) Channel 7 Busy */
#define EVSYS_CHSTATUS_CHBUSY7      (1 << EVSYS_CHSTATUS_CHBUSY7_Pos)
#define EVSYS_CHSTATUS_CHBUSY_Pos   8            /**< \brief (EVSYS_CHSTATUS) Channel x Busy */
#define EVSYS_CHSTATUS_CHBUSY_Msk   (0xFFul << EVSYS_CHSTATUS_CHBUSY_Pos)
#define EVSYS_CHSTATUS_CHBUSY(value) (EVSYS_CHSTATUS_CHBUSY_Msk & ((value) << EVSYS_CHSTATUS_CHBUSY_Pos))
#define EVSYS_CHSTATUS_USRRDY8_Pos  16           /**< \brief (EVSYS_CHSTATUS) Channel 8 User Ready */
#define EVSYS_CHSTATUS_USRRDY8      (1 << EVSYS_CHSTATUS_USRRDY8_Pos)
#define EVSYS_CHSTATUS_USRRDY9_Pos  17           /**< \brief (EVSYS_CHSTATUS) Channel 9 User Ready */
#define EVSYS_CHSTATUS_USRRDY9      (1 << EVSYS_CHSTATUS_USRRDY9_Pos)
#define EVSYS_CHSTATUS_USRRDY10_Pos 18           /**< \brief (EVSYS_CHSTATUS) Channel 10 User Ready */
#define EVSYS_CHSTATUS_USRRDY10     (1 << EVSYS_CHSTATUS_USRRDY10_Pos)
#define EVSYS_CHSTATUS_USRRDY11_Pos 19           /**< \brief (EVSYS_CHSTATUS) Channel 11 User Ready */
#define EVSYS_CHSTATUS_USRRDY11     (1 << EVSYS_CHSTATUS_USRRDY11_Pos)
#define EVSYS_CHSTATUS_USRRDYp8_Pos 16           /**< \brief (EVSYS_CHSTATUS) Channel x+8 User Ready */
#define EVSYS_CHSTATUS_USRRDYp8_Msk (0xFul << EVSYS_CHSTATUS_USRRDYp8_Pos)
#define EVSYS_CHSTATUS_USRRDYp8(value) (EVSYS_CHSTATUS_USRRDYp8_Msk & ((value) << EVSYS_CHSTATUS_USRRDYp8_Pos))
#define EVSYS_CHSTATUS_CHBUSY8_Pos  24           /**< \brief (EVSYS_CHSTATUS) Channel 8 Busy */
#define EVSYS_CHSTATUS_CHBUSY8      (1 << EVSYS_CHSTATUS_CHBUSY8_Pos)
#define EVSYS_CHSTATUS_CHBUSY9_Pos  25           /**< \brief (EVSYS_CHSTATUS) Channel 9 Busy */
#define EVSYS_CHSTATUS_CHBUSY9      (1 << EVSYS_CHSTATUS_CHBUSY9_Pos)
#define EVSYS_CHSTATUS_CHBUSY10_Pos 26           /**< \brief (EVSYS_CHSTATUS) Channel 10 Busy */
#define EVSYS_CHSTATUS_CHBUSY10     (1 << EVSYS_CHSTATUS_CHBUSY10_Pos)
#define EVSYS_CHSTATUS_CHBUSY11_Pos 27           /**< \brief (EVSYS_CHSTATUS) Channel 11 Busy */
#define EVSYS_CHSTATUS_CHBUSY11     (1 << EVSYS_CHSTATUS_CHBUSY11_Pos)
#define EVSYS_CHSTATUS_CHBUSYp8_Pos 24           /**< \brief (EVSYS_CHSTATUS) Channel x+8 Busy */
#define EVSYS_CHSTATUS_CHBUSYp8_Msk (0xFul << EVSYS_CHSTATUS_CHBUSYp8_Pos)
#define EVSYS_CHSTATUS_CHBUSYp8(value) (EVSYS_CHSTATUS_CHBUSYp8_Msk & ((value) << EVSYS_CHSTATUS_CHBUSYp8_Pos))
#define EVSYS_CHSTATUS_MASK         0x0F0FFFFFul /**< \brief (EVSYS_CHSTATUS) MASK Register */

/* -------- EVSYS_INTENCLR : (EVSYS Offset: 0x10) (R/W 32) Interrupt Enable Clear -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
    struct {
        uint32_t OVR0: 1;          /*!< bit:      0  Channel 0 Overrun Interrupt Enable */
        uint32_t OVR1: 1;          /*!< bit:      1  Channel 1 Overrun Interrupt Enable */
        uint32_t OVR2: 1;          /*!< bit:      2  Channel 2 Overrun Interrupt Enable */
        uint32_t OVR3: 1;          /*!< bit:      3  Channel 3 Overrun Interrupt Enable */
        uint32_t OVR4: 1;          /*!< bit:      4  Channel 4 Overrun Interrupt Enable */
        uint32_t OVR5: 1;          /*!< bit:      5  Channel 5 Overrun Interrupt Enable */
        uint32_t OVR6: 1;          /*!< bit:      6  Channel 6 Overrun Interrupt Enable */
        uint32_t OVR7: 1;          /*!< bit:      7  Channel 7 Overrun Interrupt Enable */
        uint32_t EVD0: 1;          /*!< bit:      8  Channel 0 Event Detection Interrupt Enable */
        uint32_t EVD1: 1;          /*!< bit:      9  Channel 1 Event Detection Interrupt Enable */
        uint32_t EVD2: 1;          /*!< bit:     10  Channel 2 Event Detection Interrupt Enable */
        uint32_t EVD3: 1;          /*!< bit:     11  Channel 3 Event Detection Interrupt Enable */
        uint32_t EVD4: 1;          /*!< bit:     12  Channel 4 Event Detection Interrupt Enable */
        uint32_t EVD5: 1;          /*!< bit:     13  Channel 5 Event Detection Interrupt Enable */
        uint32_t EVD6: 1;          /*!< bit:     14  Channel 6 Event Detection Interrupt Enable */
        uint32_t EVD7: 1;          /*!< bit:     15  Channel 7 Event Detection Interrupt Enable */
        uint32_t OVR8: 1;          /*!< bit:     16  Channel 8 Overrun Interrupt Enable */
        uint32_t OVR9: 1;          /*!< bit:     17  Channel 9 Overrun Interrupt Enable */
        uint32_t OVR10: 1;         /*!< bit:     18  Channel 10 Overrun Interrupt Enable */
        uint32_t OVR11: 1;         /*!< bit:     19  Channel 11 Overrun Interrupt Enable */
        uint32_t : 4;              /*!< bit: 20..23  Reserved                           */
        uint32_t EVD8: 1;          /*!< bit:     24  Channel 8 Event Detection Interrupt Enable */
        uint32_t EVD9: 1;          /*!< bit:     25  Channel 9 Event Detection Interrupt Enable */
        uint32_t EVD10: 1;         /*!< bit:     26  Channel 10 Event Detection Interrupt Enable */
        uint32_t EVD11: 1;         /*!< bit:     27  Channel 11 Event Detection Interrupt Enable */
        uint32_t : 4;              /*!< bit: 28..31  Reserved                           */
    } bit;                       /*!< Structure used for bit  access                  */
    struct {
        uint32_t OVR: 8;           /*!< bit:  0.. 7  Channel x Overrun Interrupt Enable */
        uint32_t EVD: 8;           /*!< bit:  8..15  Channel x Event Detection Interrupt Enable */
        uint32_t OVRp8: 4;         /*!< bit: 16..19  Channel x+8 Overrun Interrupt Enable */
        uint32_t : 4;              /*!< bit: 20..23  Reserved                           */
        uint32_t EVDp8: 4;         /*!< bit: 24..27  Channel x+8 Event Detection Interrupt Enable */
        uint32_t : 4;              /*!< bit: 28..31  Reserved                           */
    } vec;                       /*!< Structure used for vec  access                  */
    uint32_t reg;                /*!< Type      used for register access              */
} EVSYS_INTENCLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define EVSYS_INTENCLR_OFFSET       0x10         /**< \brief (EVSYS_INTENCLR offset) Interrupt Enable Clear */
#define EVSYS_INTENCLR_RESETVALUE   0x00000000ul /**< \brief (EVSYS_INTENCLR reset_value) Interrupt Enable Clear */

